{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "existingWorkspaceName": {
            "type": "string",
            "metadata": {
                "description": "The name of the Sentinel workspace where the automation rule will be deployed"
            }
        }
    },
    "variables": {
        "automationRuleName": "AddTasks - (Preview) TI map Domain entity to Dns Events (ASIM DNS Schema)",
        "automationRuleGuid": "172bdb71-fe8a-4f3c-b3a6-5f62bcc9e896",
        "existingRuleId": "883f6ac0-5d4e-48d8-87f2-ffb3bd3bfcbb"
    },
    "resources": [
        {
            "type": "Microsoft.SecurityInsights/automationRules",
            "name": "[variables('automationRuleGuid')]",
            "scope": "[concat('Microsoft.OperationalInsights/workspaces/', parameters('existingWorkspaceName'))]",
            "apiVersion": "2022-12-01-preview",
            "properties": {
                "displayName": "[variables('automationRuleName')]",
                "order": 100,
                "triggeringLogic": {
                    "isEnabled": true,
                    "expirationTimeUtc": null,
                    "triggersOn": "Incidents",
                    "triggersWhen": "Created",
                    "conditions": [
                            {
                                "conditionType": "Property",
                                "conditionProperties": {
                                    "propertyName": "IncidentRelatedAnalyticRuleIds",
                                    "operator": "Contains",
                                    "propertyValues": [
                                        "[resourceId('Microsoft.OperationalInsights/workspaces/providers/alertRules',parameters('existingWorkspaceName'),'Microsoft.SecurityInsights',variables('existingRuleId'))]"
                                    ]
                                }
                            }
                    ]
                },
                "actions":[
                  {
                    "order": 1,
                    "actionType": "AddIncidentTask",
                    "actionConfiguration": {
                      "title": "Confirm whether TI mapping is a true positive",
                      "description": "<div><strong>Double check the mapped TI domain via enrichment</strong></div><div><br></div><div>Confirm whether the domain is malicious with tools such as:</div><ul><li><a href=\"https://www.virustotal.com/\" rel=\"noopener noreferrer\" target=\"_blank\">VirusTotal</a></li><li><a href=\"https://urlscan.io/\" rel=\"noopener noreferrer\" target=\"_blank\">URLScan</a></li><li><a href=\"https://www.browserling.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Browserling</a></li><li><a href=\"https://www.whois.com/whois/\" rel=\"noopener noreferrer\" target=\"_blank\">WhoIs</a></li></ul><div><br></div><div>If domain is malicious continue on, otherwise note as False Positive.</div>"
                    }
                  },
                  {
                    "order": 2,
                    "actionType": "AddIncidentTask",
                    "actionConfiguration": {
                      "title": "Check on records involving domain",
                      "description": "<div>To scope the recorded interactions involved with the domain you can use the \"search\" command in KQL:</div><pre  spellcheck=\"false\">search \"&lt;INSERT DOMAIN&gt;\"\n| summarize count() by $table\n</pre><div><br></div><div>e.g.</div><div><br></div><div><br></div><div><br></div><div><br></div><pre class=\"ql-syntax\" spellcheck=\"false\">search \"malicious.xyz\"\n| summarize count() by $table\n</pre><div><br></div><div>The results will display which tables have recorded instances of the string entered.</div>"
                    }
                  },
                  {
                    "order": 3,
                    "actionType": "AddIncidentTask",
                    "actionConfiguration": {
                      "title": "Check on actions involving domain",
                      "description": "<div><strong>Using the above tables drill down into each of the log tables to view related events for malicious activity</strong></div><div><br></div><div>For example, if the above results listed a series of events in the DnsEvents table, you can check what the DNS A requests were resolving to, or the DeviceNetworkEvents can be checked to determine what processes, command line arguments, and devices are involved.</div><div><br></div><div>The search command can be used again to gain the full scope of relevance and then exclusions can be made where necessary.</div><div><br></div><div>e.g.</div><pre  spellcheck=\"false\">DeviceNetworkEvents\n|search \"malicious.xyz\"\n</pre><div><br></div><div>Further, due to the ASIM rule, Microsoft Parsers will allow you to search using specific schemas (this rule uses the ASIM DNS Schema): <a href=\"https://learn.microsoft.com/en-us/azure/sentinel/normalization-about-schemas\" rel=\"noopener noreferrer\" target=\"_blank\">Advanced Security Information Model (ASIM) schemas | Microsoft Learn</a></div><div><br></div><div>Information on using ASIM parsers: <a href=\"https://learn.microsoft.com/en-us/azure/sentinel/normalization-about-parsers\" rel=\"noopener noreferrer\" target=\"_blank\">Use Advanced Security Information Model (ASIM) parsers | Microsoft Learn</a></div>"
                    }
                  },
                  {
                    "order": 4,
                    "actionType": "AddIncidentTask",
                    "actionConfiguration": {
                      "title": "Determine need for containment and remediation",
                      "description": "<div>If malicious activity has occurred and was not stopped by any form of security solution(s) such as firewall, XDR, or security tooling, follow standard operating procedures for containment and remediation.</div><div><br></div><div>These would commonly involve:</div><ul><li>Isolate and scan affected devices</li><li>Reimage/restore affected devices</li><li>Reset affected credentials</li><li>Revoke active sessions</li><li>Other actions as required</li></ul>"
                    }
                  }
                ]
            }
        }
    ],
    "outputs": {}
}
